In [191]:
from sklearn import datasets
import numpy as np

In [192]:
bs = datasets.load_boston()

In [193]:
bs.
#it's a dictionary with key and value pairs

{'data': array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 1.5300e+01, 3.9690e+02,
         4.9800e+00],
        [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9690e+02,
         9.1400e+00],
        [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9283e+02,
         4.0300e+00],
        ...,
        [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
         5.6400e+00],
        [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9345e+02,
         6.4800e+00],
        [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
         7.8800e+00]]),
 'target': array([24. , 21.6, 34.7, 33.4, 36.2, 28.7, 22.9, 27.1, 16.5, 18.9, 15. ,
        18.9, 21.7, 20.4, 18.2, 19.9, 23.1, 17.5, 20.2, 18.2, 13.6, 19.6,
        15.2, 14.5, 15.6, 13.9, 16.6, 14.8, 18.4, 21. , 12.7, 14.5, 13.2,
        13.1, 13.5, 18.9, 20. , 21. , 24.7, 30.8, 34.9, 26.6, 25.3, 24.7,
        21.2, 19.3, 20. , 16.6, 14.4, 19.4, 19.7, 20.5, 25. , 23.4, 18.9,
        35.4, 24.7, 31.6, 23.3, 19.6, 18.7, 16. , 22.2, 25. , 33. , 23.5,
        19.4, 22. , 17.4, 20.9, 24.2, 21.7, 22.8, 23.4, 24.1, 21.4, 20. ,
        20.8, 21.2, 20.3, 28. , 23.9, 24.8, 22.9, 23.9, 26.6, 22.5, 22.2,
        23.6, 28.7, 22.6, 22. , 22.9, 25. , 20.6, 28.4, 21.4, 38.7, 43.8,
        33.2, 27.5, 26.5, 18.6, 19.3, 20.1, 19.5, 19.5, 20.4, 19.8, 19.4,
        21.7, 22.8, 18.8, 18.7, 18.5, 18.3, 21.2, 19.2, 20.4, 19.3, 22. ,
        20.3, 20.5, 17.3, 18.8, 21.4, 15.7, 16.2, 18. , 14.3, 19.2, 19.6,
        23. , 18.4, 15.6, 18.1, 17.4, 17.1, 13.3, 17.8, 14. , 14.4, 13.4,
        15.6, 11.8, 13.8, 15.6, 14.6, 17.8, 15.4, 21.5, 19.6, 15.3, 19.4,
        17. , 15.6, 13.1, 41.3, 24.3, 23.3, 27. , 50. , 50. , 50. , 22.7,
        25. , 50. , 23.8, 23.8, 22.3, 17.4, 19.1, 23.1, 23.6, 22.6, 29.4,
        23.2, 24.6, 29.9, 37.2, 39.8, 36.2, 37.9, 32.5, 26.4, 29.6, 50. ,
        32. , 29.8, 34.9, 37. , 30.5, 36.4, 31.1, 29.1, 50. , 33.3, 30.3,
        34.6, 34.9, 32.9, 24.1, 42.3, 48.5, 50. , 22.6, 24.4, 22.5, 24.4,
        20. , 21.7, 19.3, 22.4, 28.1, 23.7, 25. , 23.3, 28.7, 21.5, 23. ,
        26.7, 21.7, 27.5, 30.1, 44.8, 50. , 37.6, 31.6, 46.7, 31.5, 24.3,
        31.7, 41.7, 48.3, 29. , 24. , 25.1, 31.5, 23.7, 23.3, 22. , 20.1,
        22.2, 23.7, 17.6, 18.5, 24.3, 20.5, 24.5, 26.2, 24.4, 24.8, 29.6,
        42.8, 21.9, 20.9, 44. , 50. , 36. , 30.1, 33.8, 43.1, 48.8, 31. ,
        36.5, 22.8, 30.7, 50. , 43.5, 20.7, 21.1, 25.2, 24.4, 35.2, 32.4,
        32. , 33.2, 33.1, 29.1, 35.1, 45.4, 35.4, 46. , 50. , 32.2, 22. ,
        20.1, 23.2, 22.3, 24.8, 28.5, 37.3, 27.9, 23.9, 21.7, 28.6, 27.1,
        20.3, 22.5, 29. , 24.8, 22. , 26.4, 33.1, 36.1, 28.4, 33.4, 28.2,
        22.8, 20.3, 16.1, 22.1, 19.4, 21.6, 23.8, 16.2, 17.8, 19.8, 23.1,
        21. , 23.8, 23.1, 20.4, 18.5, 25. , 24.6, 23. , 22.2, 19.3, 22.6,
        19.8, 17.1, 19.4, 22.2, 20.7, 21.1, 19.5, 18.5, 20.6, 19. , 18.7,
        32.7, 16.5, 23.9, 31.2, 17.5, 17.2, 23.1, 24.5, 26.6, 22.9, 24.1,
        18.6, 30.1, 18.2, 20.6, 17.8, 21.7, 22.7, 22.6, 25. , 19.9, 20.8,
        16.8, 21.9, 27.5, 21.9, 23.1, 50. , 50. , 50. , 50. , 50. , 13.8,
        13.8, 15. , 13.9, 13.3, 13.1, 10.2, 10.4, 10.9, 11.3, 12.3,  8.8,
         7.2, 10.5,  7.4, 10.2, 11.5, 15.1, 23.2,  9.7, 13.8, 12.7, 13.1,
        12.5,  8.5,  5. ,  6.3,  5.6,  7.2, 12.1,  8.3,  8.5,  5. , 11.9,
        27.9, 17.2, 27.5, 15. , 17.2, 17.9, 16.3,  7. ,  7.2,  7.5, 10.4,
         8.8,  8.4, 16.7, 14.2, 20.8, 13.4, 11.7,  8.3, 10.2, 10.9, 11. ,
         9.5, 14.5, 14.1, 16.1, 14.3, 11.7, 13.4,  9.6,  8.7,  8.4, 12.8,
        10.5, 17.1, 18.4, 15.4, 10.8, 11.8, 14.9, 12.6, 14.1, 13. , 13.4,
        15.2, 16.1, 17.8, 14.9, 14.1, 12.7, 13.5, 14.9, 20. , 16.4, 17.7,
        19.5, 20.2, 21.4, 19.9, 19. , 19.1, 19.1, 20.1, 19.9, 19.6, 23.2,
        29.8, 13.8, 13.3, 16.7, 12. , 14.6, 21.4, 23. , 23.7, 25. , 21.8,
        20.6, 21.2, 19.1, 20.6, 15.2,  7. ,  8.1, 13.6, 20.1, 21.8, 24.5,
        23.1, 19.7, 18.3, 21.2, 17.5, 16.8, 22.4, 20.6, 23.9, 22. , 11.9]),
 'feature_names': array(['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD',
        'TAX', 'PTRATIO', 'B', 'LSTAT'], dtype='<U7'),
 'DESCR': ".. _boston_dataset:\n\nBoston house prices dataset\n---------------------------\n\n**Data Set Characteristics:**  \n\n    :Number of Instances: 506 \n\n    :Number of Attributes: 13 numeric/categorical predictive. Median Value (attribute 14) is usually the target.\n\n    :Attribute Information (in order):\n        - CRIM     per capita crime rate by town\n        - ZN       proportion of residential land zoned for lots over 25,000 sq.ft.\n        - INDUS    proportion of non-retail business acres per town\n        - CHAS     Charles River dummy variable (= 1 if tract bounds river; 0 otherwise)\n        - NOX      nitric oxides concentration (parts per 10 million)\n        - RM       average number of rooms per dwelling\n        - AGE      proportion of owner-occupied units built prior to 1940\n        - DIS      weighted distances to five Boston employment centres\n        - RAD      index of accessibility to radial highways\n        - TAX      full-value property-tax rate per $10,000\n        - PTRATIO  pupil-teacher ratio by town\n        - B        1000(Bk - 0.63)^2 where Bk is the proportion of blacks by town\n        - LSTAT    % lower status of the population\n        - MEDV     Median value of owner-occupied homes in $1000's\n\n    :Missing Attribute Values: None\n\n    :Creator: Harrison, D. and Rubinfeld, D.L.\n\nThis is a copy of UCI ML housing dataset.\nhttps://archive.ics.uci.edu/ml/machine-learning-databases/housing/\n\n\nThis dataset was taken from the StatLib library which is maintained at Carnegie Mellon University.\n\nThe Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic\nprices and the demand for clean air', J. Environ. Economics & Management,\nvol.5, 81-102, 1978.   Used in Belsley, Kuh & Welsch, 'Regression diagnostics\n...', Wiley, 1980.   N.B. Various transformations are used in the table on\npages 244-261 of the latter.\n\nThe Boston house-price data has been used in many machine learning papers that address regression\nproblems.   \n     \n.. topic:: References\n\n   - Belsley, Kuh & Welsch, 'Regression diagnostics: Identifying Influential Data and Sources of Collinearity', Wiley, 1980. 244-261.\n   - Quinlan,R. (1993). Combining Instance-Based and Model-Based Learning. In Proceedings on the Tenth International Conference of Machine Learning, 236-243, University of Massachusetts, Amherst. Morgan Kaufmann.\n",
 'filename': 'C:\\Users\\Vaibhav\\Anaconda3\\lib\\site-packages\\sklearn\\datasets\\data\\boston_house_prices.csv'}

In [195]:
#Data - is having X values
#DESCR - DESCRIPTION OF THE DATA
#feature names: column names of the X values
#bs.target - having y values

In [9]:
X = bs.data
X.shape

(506, 13)

In [198]:
np.set_printoptions(suppress = True, precision=2)

In [199]:
X[:4]

array([[  0.01,  18.  ,   2.31,   0.  ,   0.54,   6.58,  65.2 ,   4.09,
          1.  , 296.  ,  15.3 , 396.9 ,   4.98],
       [  0.03,   0.  ,   7.07,   0.  ,   0.47,   6.42,  78.9 ,   4.97,
          2.  , 242.  ,  17.8 , 396.9 ,   9.14],
       [  0.03,   0.  ,   7.07,   0.  ,   0.47,   7.18,  61.1 ,   4.97,
          2.  , 242.  ,  17.8 , 392.83,   4.03],
       [  0.03,   0.  ,   2.18,   0.  ,   0.46,   7.  ,  45.8 ,   6.06,
          3.  , 222.  ,  18.7 , 394.63,   2.94]])

In [200]:
y = bs.target
y.shape

(506,)

In [201]:
bos = np.c_[y,X] #automatically the concatenation

In [202]:
bos[:3]

array([[ 24.  ,   0.01,  18.  ,   2.31,   0.  ,   0.54,   6.58,  65.2 ,
          4.09,   1.  , 296.  ,  15.3 , 396.9 ,   4.98],
       [ 21.6 ,   0.03,   0.  ,   7.07,   0.  ,   0.47,   6.42,  78.9 ,
          4.97,   2.  , 242.  ,  17.8 , 396.9 ,   9.14],
       [ 34.7 ,   0.03,   0.  ,   7.07,   0.  ,   0.47,   7.18,  61.1 ,
          4.97,   2.  , 242.  ,  17.8 , 392.83,   4.03]])

In [14]:
X.shape, y.shape, X.ndim, y.ndim

((506, 13), (506,), 2, 1)

In [15]:
y = y.reshape(-1, 1)
y.shape

(506, 1)

In [16]:
bos = np.concatenate((y,X),axis = 1)

In [17]:
bos.shape

(506, 14)

In [18]:
bos[0,0]

24.0

In [19]:
import pandas as pd

In [20]:
list(bs.feature_names)

['CRIM',
 'ZN',
 'INDUS',
 'CHAS',
 'NOX',
 'RM',
 'AGE',
 'DIS',
 'RAD',
 'TAX',
 'PTRATIO',
 'B',
 'LSTAT']

In [203]:
bosdf = pd.DataFrame(bos, columns = ['medv'] + list(bs.feature_names))
bosdf[:3]

,medv,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03

In [206]:
ir = datasets.load_iris()

In [208]:
X = ir.data
X.shape

(150, 4)

In [209]:
y = ir.target
y

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

In [210]:
iris = np.c_[y,X]

In [211]:
df = pd.DataFrame(iris, columns=["Species"]+list(ir.feature_names))

In [212]:
df.head(3)

,Species,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
0,0.0,5.1,3.5,1.4,0.2
1,0.0,4.9,3.0,1.4,0.2
2,0.0,4.7,3.2,1.3,0.2

# PANDAS DATAFRAME

In [22]:
#Heterogenous data-structure - unlike numpy arrays
#but each column will be homogenous
#so it's built over numpy and scipy and hence we can apply functions on pandas dataframe

### Create a df

In [23]:
import pandas as pd
#from a dictionary #values in the list format
dict1 = {
"country":["Brazil", "Russia", "India", "China", "South Africa"],
"capital":["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
"area":[8.516, 17.10, 3.286, 9.597,1.221],
"population":[200.4, 143.5, 1252, 1357,52.98] }

In [24]:
pd.DataFrame(dict1)

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [25]:
brics = pd.DataFrame(dict1, index = ['A', 'B', 'C', 'D', 'E'])
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [100]:
hyp.Gender.astype("str")

ID
70     False
121     True
86     False
141    False
172    False
113    False
50     False
11     False
84     False
48     False
75     False
60     False
95     False
104    False
38     False
115    False
76     False
195    False
114    False
85     False
167    False
143    False
41     False
20     False
12     False
53     False
154    False
178    False
196    False
29     False
       ...
119     True
13      True
51      True
26      True
36      True
135     True
59      True
78      True
64      True
63      True
79      True
193     True
92      True
160     True
32      True
23      True
158     True
25      True
188     True
52      True
124     True
175     True
184     True
30      True
179     True
31      True
145     True
187     True
118     True
137     True
Name: Gender, Length: 200, dtype: object

In [26]:
#you can control the number of columns being imported from the dictionary using the columns tab
df = pd.DataFrame(dict1, index = ['A','B','C', 'D', 'E'], columns = ['country', 'capital', 'area'])
df

        country    capital    area
A        Brazil   Brasilia   8.516
B        Russia     Moscow  17.100
C         India  New Delhi   3.286
D         China    Beijing   9.597
E  South Africa   Pretoria   1.221

In [27]:
dict1

{'country': ['Brazil', 'Russia', 'India', 'China', 'South Africa'],
 'capital': ['Brasilia', 'Moscow', 'New Delhi', 'Beijing', 'Pretoria'],
 'area': [8.516, 17.1, 3.286, 9.597, 1.221],
 'population': [200.4, 143.5, 1252, 1357, 52.98]}

In [28]:
#case of the column names is important
df = pd.DataFrame(dict1, index = ['A','B','C', 'D', 'E'], columns = ['Country', 'capital', 'area'])
df

  Country    capital    area
A     NaN   Brasilia   8.516
B     NaN     Moscow  17.100
C     NaN  New Delhi   3.286
D     NaN    Beijing   9.597
E     NaN   Pretoria   1.221

In [29]:
#Each column / row a in df is a pandas series - it's a heterogenous unidimensionalds
dict_2 = {'country': "South Africa", 
          "Capital": "Pretoria", 
         "area": 1.22, 
          "population": 52.98}

In [30]:
x = pd.Series(dict_2)
x

country       South Africa
Capital           Pretoria
area                  1.22
population           52.98
dtype: object

In [31]:
type(x), type(df)

(pandas.core.series.Series, pandas.core.frame.DataFrame)

In [32]:
x.shape, df.shape

((4,), (5, 3))

In [33]:
#creating a df from a list of dictionaries
pd.DataFrame([{"name": "Raj", "Age": 21}, {"name": "Mukul", "Age": 25 },{"name": "Rahul", "Age": 30}])

   Age   name
0   21    Raj
1   25  Mukul
2   30  Rahul

In [34]:
#creating a df using lists of row values
lst_1 = ["Brazil", "Brasilia", 8.516, 200.40]
lst_2 = ["South Africa", "Pretoria", 1.22, 52.98]

In [35]:
brics.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [36]:
brics.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [37]:
pd.DataFrame(data = [lst_1, lst_2], columns = brics.columns, index = ["A", "B"])

        country   capital   area  population
A        Brazil  Brasilia  8.516      200.40
B  South Africa  Pretoria  1.220       52.98

In [38]:
#Create the dataframe using series
ser = pd.Series(data = [200.4, 123,231, 123], index = ["Brazil", "Russia","India", "China"])
ser

Brazil    200.4
Russia    123.0
India     231.0
China     123.0
dtype: float64

In [39]:
s = pd.Series(data = [200.4, 123,231, 123])

In [40]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [41]:
ser["Russia"]

123.0

In [94]:
pd.DataFrame(ser, columns = ["Population"])

        Population
Brazil       200.4
Russia       123.0
India        231.0
China        123.0

----

### Row Indices and the column names

In [42]:
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [43]:
brics.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [44]:
brics.columns = ['co', 'cap', 'ar', 'pop']
brics

             co        cap      ar      pop
A        Brazil   Brasilia   8.516   200.40
B        Russia     Moscow  17.100   143.50
C         India  New Delhi   3.286  1252.00
D         China    Beijing   9.597  1357.00
E  South Africa   Pretoria   1.221    52.98

In [99]:
brics.columns[1]

'cap'

In [45]:
brics.columns[1] = "Capital" #we can't change 1 element of the cols

TypeError: Index does not support mutable operations

In [100]:
x = list(brics.columns)
x

['co', 'cap', 'ar', 'pop']

In [101]:
x[2] = "area"
x[0] = "country"
x

['country', 'cap', 'area', 'pop']

In [102]:
brics.columns = x
brics

        country        cap    area      pop
A        Brazil   Brasilia   8.516   200.40
B        Russia     Moscow  17.100   143.50
C         India  New Delhi   3.286  1252.00
D         China    Beijing   9.597  1357.00
E  South Africa   Pretoria   1.221    52.98

In [48]:
#rename function
df = brics.rename(columns = {'cap': "capital", "pop": "population"})
df

             co    capital      ar  population
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [50]:
brics.rename(columns = {'cap': "capital", "pop": "population"}, inplace = True)

In [51]:
brics

             co    capital      ar  population
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [55]:
brics.set_index("ar", inplace = True) 
#we can create a middle col into index col but we lose the info of the columns before it

In [56]:
brics

          capital  population
ar
8.516    Brasilia      200.40
17.100     Moscow      143.50
3.286   New Delhi     1252.00
9.597     Beijing     1357.00
1.221    Pretoria       52.98

In [57]:
brics.reset_index()

       ar    capital  population
0   8.516   Brasilia      200.40
1  17.100     Moscow      143.50
2   3.286  New Delhi     1252.00
3   9.597    Beijing     1357.00
4   1.221   Pretoria       52.98

In [58]:
brics = pd.DataFrame(dict1, index = ['A', 'B', 'C', 'D', 'E'])
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [60]:
brics.set_index("country", inplace = True)

In [61]:
brics

                capital    area  population
country
Brazil         Brasilia   8.516      200.40
Russia           Moscow  17.100      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98

In [62]:
#same way we can change the row index of selected rows
brics.rename(index = {'South Africa': "SA"}, inplace = True)

In [63]:
brics

           capital    area  population
country
Brazil    Brasilia   8.516      200.40
Russia      Moscow  17.100      143.50
India    New Delhi   3.286     1252.00
China      Beijing   9.597     1357.00
SA        Pretoria   1.221       52.98

In [66]:
brics  = brics.rename(mapper = str.lower, axis = 'columns')

In [67]:
brics

           capital    area  population
country
brazil    Brasilia   8.516      200.40
russia      Moscow  17.100      143.50
india    New Delhi   3.286     1252.00
china      Beijing   9.597     1357.00
sa        Pretoria   1.221       52.98

In [110]:
brics.rename(mapper = str.lower, inplace = True) #default axis is rows

In [68]:
brics

           capital    area  population
country
brazil    Brasilia   8.516      200.40
russia      Moscow  17.100      143.50
india    New Delhi   3.286     1252.00
china      Beijing   9.597     1357.00
sa        Pretoria   1.221       52.98

In [69]:
brics.index

Index(['brazil', 'russia', 'india', 'china', 'sa'], dtype='object', name='country')

In [70]:
brics.reset_index(inplace = True)

In [71]:
brics

  country    capital    area  population
0  brazil   Brasilia   8.516      200.40
1  russia     Moscow  17.100      143.50
2   india  New Delhi   3.286     1252.00
3   china    Beijing   9.597     1357.00
4      sa   Pretoria   1.221       52.98

In [118]:
#brics.set_index('COUNTRY', inplace=True)

In [119]:
brics.reset_index(inplace = True)

In [120]:
brics

   index       country    capital    area  population
0      0        Brazil   Brasilia   8.516      200.40
1      1        Russia     Moscow  17.100      143.50
2      2         India  New Delhi   3.286     1252.00
3      3         China    Beijing   9.597     1357.00
4      4  South Africa   Pretoria   1.221       52.98

-----

In [72]:
movies = pd.read_csv(r'C:\Users\Vaibhav\Desktop\BA\Datasets\movies.csv', na_values = ['?', "NA", 1])
movies.head(3)

,movieId,title,genres
0,NaN,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2.0,Jumanji (1995),Adventure|Children|Fantasy
2,3.0,Grumpier Old Men (1995),Comedy|Romance

In [122]:
movies = pd.read_csv(r'C:\Users\Vaibhav\Desktop\BA\Datasets\movies.csv', index_col = 0, na_values = {'genres':['?', "NA", "1", ""], "title": ["","Jumanji (1995)"]})
movies.head(3)

                           title                                       genres
movieId
1               Toy Story (1995)  Adventure|Animation|Children|Comedy|Fantasy
2                            NaN                   Adventure|Children|Fantasy
3        Grumpier Old Men (1995)                               Comedy|Romance

In [74]:
import pandas as pd
hy = pd.read_excel(r'C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 13 Association Rules Ex 2.xlsx', sheet_name= "Sheet1")

In [124]:
hy.head(3)

,Date,Bill Number,Item Desc,Time,Quantity,Rate,Tax,Discount,Total,Category
0,2010-04-01,G0470115,QUA MINERAL WATER(1000ML),13:15:11,1,50.0,11.88,0.0,61.88,BEVERAGE
1,2010-04-01,G0470115,MONSOON MALABAR (AULAIT),13:15:11,1,100.0,23.75,0.0,123.75,BEVERAGE
2,2010-04-01,G0470116,MASALA CHAI CUTTING,13:17:35,1,40.0,9.50,0.0,49.50,BEVERAGE

In [75]:
import pandas as pd
hy = pd.read_excel(r'C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 13 Association Rules Ex 2.xlsx', sheet_name= ["Sheet1","ABC"])
#hy

In [77]:
hy['Sheet1'].head(3)

,Date,Bill Number,Item Desc,Time,Quantity,Rate,Tax,Discount,Total,Category
0,2010-04-01,G0470115,QUA MINERAL WATER(1000ML),13:15:11,1,50.0,11.88,0.0,61.88,BEVERAGE
1,2010-04-01,G0470115,MONSOON MALABAR (AULAIT),13:15:11,1,100.0,23.75,0.0,123.75,BEVERAGE
2,2010-04-01,G0470116,MASALA CHAI CUTTING,13:17:35,1,40.0,9.50,0.0,49.50,BEVERAGE

In [81]:
hy['ABC']

   Unnamed: 0 Unnamed: 1
0         NaN        NaN
1         NaN          s
2         3.0          4

In [80]:
hy['Sheet1'].shape

(145830, 10)

In [82]:
hy = pd.read_excel(r'C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 13 Association Rules Ex 2.xlsx', sheet_name= "Sheet1")

In [137]:
hy = pd.read_excel(r'C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 13 Association Rules Ex 2.xlsx', sheet_name= [0,1])

In [138]:
hy[1]

   Unnamed: 0 Unnamed: 1
0         NaN        NaN
1         NaN          s
2         3.0          4

In [ ]:
hy[0]

In [139]:
hy = hy[0]

In [ ]:
#or hy = hy['Sheet1']

In [140]:
hy.head()

,Date,Bill Number,Item Desc,Time,Quantity,Rate,Tax,Discount,Total,Category
0,2010-04-01,G0470115,QUA MINERAL WATER(1000ML),13:15:11,1,50.0,11.88,0.0,61.88,BEVERAGE
1,2010-04-01,G0470115,MONSOON MALABAR (AULAIT),13:15:11,1,100.0,23.75,0.0,123.75,BEVERAGE
2,2010-04-01,G0470116,MASALA CHAI CUTTING,13:17:35,1,40.0,9.50,0.0,49.50,BEVERAGE
3,2010-04-01,G0470117,QUA MINERAL WATER(1000ML),13:19:55,1,50.0,11.88,0.0,61.88,BEVERAGE
4,2010-04-01,G0470283,MOROCCAN MINT TEA,01:20:18,1,45.0,10.69,0.0,55.69,BEVERAGE

In [141]:
hy.tail()

,Date,Bill Number,Item Desc,Time,Quantity,Rate,Tax,Discount,Total,Category
145825,2010-05-22,N0028716,ZINZI WHITE (GLS),21:43:55,2,150.0,78.0,0.0,378.0,LIQUOR
145826,2010-04-27,N0028343,ZINZI WHITE (GLS),20:52:11,2,150.0,78.0,0.0,378.0,LIQUOR
145827,2010-05-28,N0028835,ZINZI WHITE (GLS),01:03:37,3,150.0,117.0,0.0,567.0,LIQUOR
145828,2010-04-30,N0028399,ZINZI WHITE (GLS),23:44:37,1,150.0,39.0,0.0,189.0,LIQUOR
145829,2010-07-09,N0029472,ZINZI WHITE (BTL),00:31:51,1,700.0,182.0,0.0,882.0,LIQUOR

In [ ]:
hy.shape

In [86]:
mov = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\movies.dat",
                 sep = "::", header = None, names = ["MovieID","Title", "Genres"])
mov.head(10)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

   MovieID                               Title                        Genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy
5        6                         Heat (1995)         Action|Crime|Thriller
6        7                      Sabrina (1995)                Comedy|Romance
7        8                 Tom and Huck (1995)          Adventure|Children's
8        9                 Sudden Death (1995)                        Action
9       10                    GoldenEye (1995)     Action|Adventure|Thriller

In [87]:
movies = pd.read_table(r"C:\Users\Vaibhav\Desktop\BA\Datasets\movies.dat", sep ='::', header = None, names = ["MovieID","Title", "Genres"])

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.
C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [88]:
movies.head()

   MovieID                               Title                        Genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

In [89]:
#movies

In [90]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3883 entries, 0 to 3882
Data columns (total 3 columns):
MovieID    3883 non-null int64
Title      3883 non-null object
Genres     3883 non-null object
dtypes: int64(1), object(2)
memory usage: 91.1+ KB

In [ ]:
movies.dtypes

In [91]:
hyp = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 8-9 Hypothesis Testing Ex 1.csv", index_col = 0)

In [93]:
hyp.head(3)

     Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
ID
70        0     4    1       1     1    57     52     41     47   57
121       1     4    2       1     3    68     59     53     63   61
86        0     4    3       1     1    44     33     54     58   31

In [94]:
hyp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 200 entries, 70 to 137
Data columns (total 10 columns):
Gender    200 non-null int64
Race      200 non-null int64
SEB       200 non-null int64
School    200 non-null int64
Prog      200 non-null int64
Read      200 non-null int64
Write     200 non-null int64
Math1     200 non-null int64
Math2     200 non-null int64
SST       200 non-null int64
dtypes: int64(10)
memory usage: 17.2 KB

In [95]:
#To change the dtype of gender to boolean
type(hyp.Gender)

pandas.core.series.Series

In [98]:
type(hyp.Gender)

pandas.core.series.Series

In [96]:
hyp.Gender = hyp.Gender.astype(np.bool)
hyp.head(3)

     Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
ID
70    False     4    1       1     1    57     52     41     47   57
121    True     4    2       1     3    68     59     53     63   61
86    False     4    3       1     1    44     33     54     58   31

In [ ]:
hyp = hyp.astype({'Gender': str, 'Read': np.float64})
hyp.head(3)

In [ ]:
hyp.Math1 = hyp.Math1.astype(np.float64)

In [ ]:
#suppose I want to convert multiple cols into categorical type

In [101]:
hyp.columns

Index(['Gender', 'Race', 'SEB', 'School', 'Prog', 'Read', 'Write', 'Math1',
       'Math2', 'SST'],
      dtype='object')

In [ ]:
hyp.Gender 
#or
hyp['Gender']
#both can be used to retrieve a series

In [108]:
hyp[['Gender', 'Race']].head(3)

    Gender Race
ID
70   False    4
121   True    4
86   False    4

In [102]:
categorical = list(hyp.columns)[0:5]

In [103]:
for i in categorical:
    hyp[i] = hyp[i].astype('category')
hyp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 200 entries, 70 to 137
Data columns (total 10 columns):
Gender    200 non-null category
Race      200 non-null category
SEB       200 non-null category
School    200 non-null category
Prog      200 non-null category
Read      200 non-null int64
Write     200 non-null int64
Math1     200 non-null int64
Math2     200 non-null int64
SST       200 non-null int64
dtypes: category(5), int64(5)
memory usage: 10.9 KB

In [109]:
np.unique(hyp.Gender)

array([False, True], dtype=object)

In [110]:
pd.value_counts(hyp.Gender)

True     109
False     91
Name: Gender, dtype: int64

In [111]:
hyp.Gender.value_counts()

True     109
False     91
Name: Gender, dtype: int64

In [112]:
hyp['Gender'].value_counts()

True     109
False     91
Name: Gender, dtype: int64

---

### Slicing Dataframes

In [113]:
brics

  country    capital    area  population
0  brazil   Brasilia   8.516      200.40
1  russia     Moscow  17.100      143.50
2   india  New Delhi   3.286     1252.00
3   china    Beijing   9.597     1357.00
4      sa   Pretoria   1.221       52.98

In [115]:
#to drop row indexed 1
brics.drop(1, axis = 0)

  country    capital   area  population
0  brazil   Brasilia  8.516      200.40
2   india  New Delhi  3.286     1252.00
3   china    Beijing  9.597     1357.00
4      sa   Pretoria  1.221       52.98

In [116]:
brics.drop([1, 3,4], axis = 0)

  country    capital   area  population
0  brazil   Brasilia  8.516       200.4
2   india  New Delhi  3.286      1252.0

In [117]:
brics.drop("country", axis=1)

     capital    area  population
0   Brasilia   8.516      200.40
1     Moscow  17.100      143.50
2  New Delhi   3.286     1252.00
3    Beijing   9.597     1357.00
4   Pretoria   1.221       52.98

In [119]:
brics.drop(["country", "area"], axis = 1)

     capital  population
0   Brasilia      200.40
1     Moscow      143.50
2  New Delhi     1252.00
3    Beijing     1357.00
4   Pretoria       52.98

In [120]:
brics.rename(mapper = str.upper, axis = "columns", inplace = True)

In [122]:
#access the rows
brics[1:4:2] #all the list slicing ways are applicable here

  COUNTRY  CAPITAL    AREA  POPULATION
1  russia   Moscow  17.100       143.5
3   china  Beijing   9.597      1357.0

In [124]:
brics[::-1]

  COUNTRY    CAPITAL    AREA  POPULATION
4      sa   Pretoria   1.221       52.98
3   china    Beijing   9.597     1357.00
2   india  New Delhi   3.286     1252.00
1  russia     Moscow  17.100      143.50
0  brazil   Brasilia   8.516      200.40

In [123]:
#brics[4] #integer indexing does not work

In [125]:
brics["COUNTRY"]

0    brazil
1    russia
2     india
3     china
4        sa
Name: COUNTRY, dtype: object

In [163]:
#to retrieve a few columns
l = brics[['COUNTRY', 'CAPITAL']]
l

        COUNTRY    CAPITAL
0        Brazil   Brasilia
1        Russia     Moscow
2         India  New Delhi
3         China    Beijing
4  South Africa   Pretoria

In [127]:
#To retrieve a unidimensional series
brics['COUNTRY']

0    brazil
1    russia
2     india
3     china
4        sa
Name: COUNTRY, dtype: object

In [128]:
#To retrieve a unidimensional series
brics.COUNTRY

0    brazil
1    russia
2     india
3     china
4        sa
Name: COUNTRY, dtype: object

In [129]:
brics[["COUNTRY"]] #Retrieves the pandas df

  COUNTRY
0  brazil
1  russia
2   india
3   china
4      sa

In [133]:
brics.COUNTRY=="china"

0    False
1    False
2    False
3     True
4    False
Name: COUNTRY, dtype: bool

In [134]:
brics[brics.COUNTRY=="china"]

  COUNTRY  CAPITAL   AREA  POPULATION
3   china  Beijing  9.597      1357.0

In [130]:
np.logical_and(brics.CAPITAL == "New Delhi", brics.COUNTRY =="China")

0    False
1    False
2    False
3    False
4    False
Name: CAPITAL, dtype: bool

In [131]:
np.logical_or(brics.CAPITAL == "New Delhi", brics.AREA<10)

0     True
1    False
2     True
3     True
4     True
Name: CAPITAL, dtype: bool

In [164]:
brics[brics.CAPITAL == "New Delhi"]

  COUNTRY    CAPITAL   AREA  POPULATION
2   India  New Delhi  3.286      1252.0

In [165]:
#to retrieve all the rows except for the row matching the condition
brics[~(brics.CAPITAL == "New Delhi")]

        COUNTRY   CAPITAL    AREA  POPULATION
0        Brazil  Brasilia   8.516      200.40
1        Russia    Moscow  17.100      143.50
3         China   Beijing   9.597     1357.00
4  South Africa  Pretoria   1.221       52.98

In [ ]:
brics[np.logical_or(brics.CAPITAL == "New Delhi", brics.AREA<10)]

In [ ]:
brics[[True, False, True, False, True]]

#### loc command
to retrieve the rows and the columns according to row names and the column names

In [135]:
brics.set_index("COUNTRY", inplace=True)

In [137]:
brics = pd.DataFrame(dict1, index = ['A', 'B', 'C', 'D', 'E'])
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [139]:
brics = brics.rename(mapper=str.upper, axis = 1)

In [141]:
brics = brics.set_index("COUNTRY")

In [142]:
brics.head(3)

           CAPITAL    AREA  POPULATION
COUNTRY
Brazil    Brasilia   8.516       200.4
Russia      Moscow  17.100       143.5
India    New Delhi   3.286      1252.0

In [143]:
brics.loc['Brazil', 'CAPITAL']

'Brasilia'

In [144]:
brics.loc[['Brazil', 'Russia', 'India'], ['CAPITAL', 'POPULATION']]

           CAPITAL  POPULATION
COUNTRY
Brazil    Brasilia       200.4
Russia      Moscow       143.5
India    New Delhi      1252.0

In [145]:
brics.loc['Brazil']

CAPITAL       Brasilia
AREA             8.516
POPULATION       200.4
Name: Brazil, dtype: object

In [149]:
brics[["CAPITAL"]]

                CAPITAL
COUNTRY
Brazil         Brasilia
Russia           Moscow
India         New Delhi
China           Beijing
South Africa   Pretoria

In [150]:
brics.loc[["CAPITAL"]]

KeyError: "None of [Index(['CAPITAL'], dtype='object', name='COUNTRY')] are in the [index]"

In [148]:
brics.loc[:,['CAPITAL']]

                CAPITAL
COUNTRY
Brazil         Brasilia
Russia           Moscow
India         New Delhi
China           Beijing
South Africa   Pretoria

In [ ]:
#bosdf - to get the top 100 rows
bosdf[:101]

In [ ]:
brics.loc[:, 'POPULATION']

In [ ]:
brics.loc['Brazil': 'China':2, :]

In [169]:
brics.loc['China': 'Brazil':-1, 'AREA':]

           AREA  POPULATION
COUNTRY
China     9.597      1357.0
India     3.286      1252.0
Russia   17.100       143.5
Brazil    8.516       200.4

In [ ]:
brics

In [151]:
brics.loc[[True, False, True, False, False], [True, False, True]]

           CAPITAL  POPULATION
COUNTRY
Brazil    Brasilia       200.4
India    New Delhi      1252.0

In [152]:
brics.CAPITAL.isin(['Moscow', 'Beijing'])

COUNTRY
Brazil          False
Russia           True
India           False
China            True
South Africa    False
Name: CAPITAL, dtype: bool

In [153]:
brics.loc[brics.CAPITAL.isin(['Moscow', 'Beijing'])]

         CAPITAL    AREA  POPULATION
COUNTRY
Russia    Moscow  17.100       143.5
China    Beijing   9.597      1357.0

In [ ]:
brics.CAPITAL.isin(['Moscow', 'Beijing'])

In [ ]:
brics.loc[:, brics.columns.isin(['CAPITAL', 'AREA'])]

In [ ]:
bosdf.loc[:3,:] #here the row indexes are the integers, and hence we are giving integer values for row indices

In [157]:
br = brics.reset_index()
br

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [159]:
br.loc[2, "COUNTRY"]

'India'

In [160]:
br.loc[2:4, "COUNTRY"] #NOTE: row indices 2, 3 and 4 are retrieved (4 not skipped, since these are row names)

2           India
3           China
4    South Africa
Name: COUNTRY, dtype: object

In [ ]:
#using iloc and loc commands we can change the positions of the columns

In [168]:
br

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [172]:
#to create population as the first column
br.loc[:,"POPULATION"::-1]

   POPULATION    AREA    CAPITAL       COUNTRY
0      200.40   8.516   Brasilia        Brazil
1      143.50  17.100     Moscow        Russia
2     1252.00   3.286  New Delhi         India
3     1357.00   9.597    Beijing         China
4       52.98   1.221   Pretoria  South Africa

----

#### iloc - row number and collumn numbers (integer location)

In [173]:
brics

                CAPITAL    AREA  POPULATION
COUNTRY
Brazil         Brasilia   8.516      200.40
Russia           Moscow  17.100      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98

In [174]:
brics.iloc[:4,2]

COUNTRY
Brazil     200.4
Russia     143.5
India     1252.0
China     1357.0
Name: POPULATION, dtype: float64

In [176]:
brics.iloc[[1],:2] #gives the first row (and 2nd col) in df format

        CAPITAL  AREA
COUNTRY
Russia   Moscow  17.1

In [177]:
brics.iloc[1,:2] #gives in the series format

CAPITAL    Moscow
AREA         17.1
Name: Russia, dtype: object

In [178]:
brics.iloc[[1]]

        CAPITAL  AREA  POPULATION
COUNTRY
Russia   Moscow  17.1       143.5

In [181]:
brics[1:3]

           CAPITAL    AREA  POPULATION
COUNTRY
Russia      Moscow  17.100       143.5
India    New Delhi   3.286      1252.0

In [179]:
brics.iloc[[1,3]]

         CAPITAL    AREA  POPULATION
COUNTRY
Russia    Moscow  17.100       143.5
China    Beijing   9.597      1357.0

In [182]:
brics.iloc[-3:-1, 1:3]

          AREA  POPULATION
COUNTRY
India    3.286      1252.0
China    9.597      1357.0

In [183]:
brics.iloc[:, brics.columns.isin(['CAPITAL', 'A', 'AREA'])]

                CAPITAL    AREA
COUNTRY
Brazil         Brasilia   8.516
Russia           Moscow  17.100
India         New Delhi   3.286
China           Beijing   9.597
South Africa   Pretoria   1.221

In [ ]:
brics.iloc[[0,1,2],[0,2]]

In [187]:
br = br.loc[::-1]

In [188]:
br

        COUNTRY    CAPITAL    AREA  POPULATION
4  South Africa   Pretoria   1.221       52.98
3         China    Beijing   9.597     1357.00
2         India  New Delhi   3.286     1252.00
1        Russia     Moscow  17.100      143.50
0        Brazil   Brasilia   8.516      200.40

In [189]:
br.iloc[[3,0], [2,3]]

     AREA  POPULATION
1  17.100      143.50
4   1.221       52.98

In [ ]:
bosdf.loc[[0,1,2], ['medv', 'CRIM']]

In [190]:
#iloc - helps us retrieving based on the row numbers and colunmn number
#loc - helps us retrieve based on row indices and column indices (i.e row names and the column names)

---

### isin function and in function

In [214]:
brics.columns

Index(['CAPITAL', 'AREA', 'POPULATION'], dtype='object')

In [217]:
brics.columns.isin(['country', 'AREA']) #gives t and false corresponding to each component

array([False,  True, False])

In [218]:
brics.columns

Index(['CAPITAL', 'AREA', 'POPULATION'], dtype='object')

In [219]:
list(brics.columns) in ['country', 'CAPITAL', 'AREA']

False

In [220]:
list(brics.columns)

['CAPITAL', 'AREA', 'POPULATION']

In [221]:
'CAPITAL' in ['country', 'CAPITAL', 'AREA']

True

In [ ]:
hyp.head(3)

In [ ]:
#to retrieve all rows having races 1 and 2

In [ ]:
hyp[hyp.Race.isin([1,2])].head()

----

### Statistical functions using axis
- axis = 0 - row-wise reduce
- axis = 1 - col wise reduce

In [223]:
hyp.head(3)

    Gender Race SEB School Prog  Read  Write  Math1  Math2  SST
ID
70   False    4   1      1    1    57     52     41     47   57
121   True    4   2      1    3    68     59     53     63   61
86   False    4   3      1    1    44     33     54     58   31

In [224]:
hyp.mean()

Gender     0.545
Race       3.430
SEB        2.055
School     1.160
Prog       2.025
Read      52.230
Write     52.775
Math1     52.645
Math2     51.850
SST       52.405
dtype: float64

In [225]:
hyp.mean(axis = 0, skipna = True)

Gender     0.545
Race       3.430
SEB        2.055
School     1.160
Prog       2.025
Read      52.230
Write     52.775
Math1     52.645
Math2     51.850
SST       52.405
dtype: float64

In [ ]:
#mean median sum std min max argmin argmax

In [226]:
hyp.Math1.quantile(.9) #90%ile value

65.1

In [227]:
hyp.Math1.quantile(.99)#99%ile

73.01999999999998

In [229]:
np.percentile(hyp.Math1, 99)
#99%ile means 99% of the class is having a score below this number

73.01999999999998

In [230]:
hyp.Math1.var()

87.76781407035176

In [231]:
hyp.Math1.skew()

0.2865652200784926

In [ ]:
#bsubsetting
hyp[hyp.Math1>50]

In [232]:
#which row numbers true is there for condition hyp.math1>50
np.where(hyp.Math1>50)#gives the location of the Trues in my data

(array([  1,   2,   4,   5,   8,   9,  10,  11,  12,  13,  16,  17,  18,
         19,  21,  23,  26,  27,  30,  31,  32,  33,  35,  36,  37,  41,
         42,  45,  47,  48,  49,  50,  52,  54,  58,  59,  61,  66,  68,
         71,  72,  73,  76,  77,  79,  80,  81,  82,  85,  86,  89,  90,
         92,  93,  95,  96,  97,  99, 100, 101, 103, 104, 105, 106, 109,
        112, 113, 114, 116, 117, 118, 122, 123, 125, 127, 128, 130, 131,
        132, 135, 136, 137, 142, 144, 151, 154, 155, 157, 159, 160, 162,
        163, 166, 168, 169, 173, 175, 176, 177, 179, 182, 183, 184, 185,
        186, 188, 189, 192, 194, 195, 197, 198, 199], dtype=int64),)

---

### Summary Functions

In [233]:
hyp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 200 entries, 70 to 137
Data columns (total 10 columns):
Gender    200 non-null category
Race      200 non-null category
SEB       200 non-null category
School    200 non-null category
Prog      200 non-null category
Read      200 non-null int64
Write     200 non-null int64
Math1     200 non-null int64
Math2     200 non-null int64
SST       200 non-null int64
dtypes: category(5), int64(5)
memory usage: 10.9 KB

In [234]:
hyp.dtypes

Gender    category
Race      category
SEB       category
School    category
Prog      category
Read         int64
Write        int64
Math1        int64
Math2        int64
SST          int64
dtype: object

In [235]:
hyp.describe() #described all the numerical columns

             Read       Write       Math1       Math2         SST
count  200.000000  200.000000  200.000000  200.000000  200.000000
mean    52.230000   52.775000   52.645000   51.850000   52.405000
std     10.252937    9.478586    9.368448    9.900891   10.735793
min     28.000000   31.000000   33.000000   26.000000   26.000000
25%     44.000000   45.750000   45.000000   44.000000   46.000000
50%     50.000000   54.000000   52.000000   53.000000   52.000000
75%     60.000000   60.000000   59.000000   58.000000   61.000000
max     76.000000   67.000000   75.000000   74.000000   71.000000

In [236]:
hyp.describe(include = 'all')

,Gender,Race,SEB,School,Prog,Read,Write,Math1,Math2,SST
count,200,200.0,200.0,200.0,200.0,200.000000,200.000000,200.000000,200.000000,200.000000
unique,2,4.0,3.0,2.0,3.0,NaN,NaN,NaN,NaN,NaN
top,True,4.0,2.0,1.0,2.0,NaN,NaN,NaN,NaN,NaN
freq,109,145.0,95.0,168.0,105.0,NaN,NaN,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,52.230000,52.775000,52.645000,51.850000,52.405000
std,NaN,NaN,NaN,NaN,NaN,10.252937,9.478586,9.368448,9.900891,10.735793
min,NaN,NaN,NaN,NaN,NaN,28.000000,31.000000,33.000000,26.000000,26.000000
25%,NaN,NaN,NaN,NaN,NaN,44.000000,45.750000,45.000000,44.000000,46.000000
50%,NaN,NaN,NaN,NaN,NaN,50.000000,54.000000,52.000000,53.000000,52.000000
75%,NaN,NaN,NaN,NaN,NaN,60.000000,60.000000,59.000000,58.000000,61.000000
max,NaN,NaN,NaN,NaN,NaN,76.000000,67.000000,75.000000,74.000000,71.000000

In [ ]:
#25%ile same as 1st quartile
#75%ile same as 3rd quartile

In [237]:
hyp.Gender.dtype

CategoricalDtype(categories=[False, True], ordered=False)

In [238]:
hyp.Race.dtype

CategoricalDtype(categories=[1, 2, 3, 4], ordered=False)

In [239]:
#univariate freq distribution of Race categorical var
pd.value_counts(hyp.Race, dropna = True)

4    145
1     24
3     20
2     11
Name: Race, dtype: int64

In [241]:
#bi-variate freq dist b/w 2 categorical col
pd.crosstab(index = hyp.Gender, columns=hyp.Race, dropna=False)

Race     1  2   3   4
Gender
False   13  3   7  68
True    11  8  13  77

In [242]:
hyp.head(3)

    Gender Race SEB School Prog  Read  Write  Math1  Math2  SST
ID
70   False    4   1      1    1    57     52     41     47   57
121   True    4   2      1    3    68     59     53     63   61
86   False    4   3      1    1    44     33     54     58   31

In [243]:
hyp.reset_index(inplace=True)

In [245]:
hyp.head(3)

    ID Gender Race SEB School Prog  Read  Write  Math1  Math2  SST
0   70  False    4   1      1    1    57     52     41     47   57
1  121   True    4   2      1    3    68     59     53     63   61
2   86  False    4   3      1    1    44     33     54     58   31

In [246]:
#pivot_table - used 3 variable aggregation
hyp.pivot_table(index = "Gender", columns="Race", values = "ID", aggfunc= lambda x: len(x))

Race     1  2   3   4
Gender
False   13  3   7  68
True    11  8  13  77

In [247]:
#Average marks in Read race and gender wise
hyp.pivot_table(index = "Gender", columns="Race", values = "Read", aggfunc= lambda x: np.mean(x))

Race            1          2          3          4
Gender
False   47.307692  52.333333  46.857143  54.514706
True    45.909091  51.750000  46.769231  53.402597

In [ ]:
### Groupby

In [248]:
hyp.groupby("Gender").mean()

                ID       Read      Write      Math1      Math2        SST
Gender
False   106.010989  52.824176  50.120879  52.945055  53.230769  51.791209
True     95.899083  51.733945  54.990826  52.394495  50.697248  52.917431

In [ ]:
hyp.groupby("Race").median()

In [249]:
hyp.groupby("SEB").min()

     ID  Read  Write  Math1  Math2  SST
SEB
1     1    28     31     39     29   26
2     2    31     31     33     34   26
3    14    34     33     38     26   31

In [251]:
hyp.groupby(["Gender", "Race"])["Read"].mean().unstack()

Race            1          2          3          4
Gender
False   47.307692  52.333333  46.857143  54.514706
True    45.909091  51.750000  46.769231  53.402597

In [256]:
hyp.groupby(["Race","Gender"])["Read", "Math1"].mean().unstack()

             Read                 Math1
Gender      False       True      False       True
Race
1       47.307692  45.909091  49.230769  45.272727
2       52.333333  51.750000  58.666667  56.750000
3       46.857143  46.769231  45.285714  47.538462
4       54.514706  53.402597  54.191176  53.779221

In [257]:
#to apply different aggregations to diff colummns
aggregation = { "Read": np.mean, 
       "Math1":[np.min, np.max, np.median],
       "Math2": np.argmin}

In [258]:
hyp.groupby("Gender").agg(aggregation)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\numpy\core\fromnumeric.py:52: FutureWarning:
The current behaviour of 'Series.argmin' is deprecated, use 'idxmin'
instead.
The behavior of 'argmin' will be corrected to return the positional
minimum in the future. For now, use 'series.values.argmin' or
'np.argmin(np.array(values))' to get the position of the minimum
row.
  return getattr(obj, method)(*args, **kwds)

             Read Math1              Math2
             mean  amin amax median argmin
Gender
False   52.824176    35   75     52     55
True    51.733945    33   72     53    129

In [259]:
#to apply different aggregations to diff colummns
aggregation = { "Read": {"Mean_Read": np.mean}, 
       "Math1":{"Min_Math1": np.min, "Max_Math1": np.max, "Median_Math1": np.median},
       "Math2": {"Argmin_Math1": np.argmin},
        "Race": {"Count_Race":'count'}} 
#note the quotes in count for the series functions

In [260]:
hyp.groupby("Gender").agg(aggregation)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\pandas\core\groupby\generic.py:1315: FutureWarning: using a dict with renaming is deprecated and will be removed in a future version
  return super(DataFrameGroupBy, self).aggregate(arg, *args, **kwargs)
C:\Users\Vaibhav\Anaconda3\lib\site-packages\numpy\core\fromnumeric.py:52: FutureWarning:
The current behaviour of 'Series.argmin' is deprecated, use 'idxmin'
instead.
The behavior of 'argmin' will be corrected to return the positional
minimum in the future. For now, use 'series.values.argmin' or
'np.argmin(np.array(values))' to get the position of the minimum
row.
  return getattr(obj, method)(*args, **kwds)

             Read     Math1                               Math2       Race
        Mean_Read Min_Math1 Max_Math1 Median_Math1 Argmin_Math1 Count_Race
Gender
False   52.824176        35        75           52           55         91
True    51.733945        33        72           53          129        109

In [ ]:
#Factor + Factor + aggregations of continuous
hyp.pivot_table(index = "Gender", columns="Race", values = "Math1", aggfunc= lambda x: x.median(skipna= True))

In [261]:
matches = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\matches.csv")

In [262]:
matches.head(3)

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,05/04/17,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,2017,Pune,06/04/17,Mumbai Indians,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN
2,3,2017,Rajkot,07/04/17,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN

In [263]:
matches.toss_decision.unique()

array(['field', 'bat'], dtype=object)

In [264]:
grouped = matches.groupby("toss_decision")

In [265]:
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [266]:
grouped

In [267]:
bat_df = grouped.get_group("bat")
bat_df.head(2)

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
4,5,2017,Bangalore,08/04/17,Royal Challengers Bangalore,Delhi Daredevils,Royal Challengers Bangalore,bat,normal,0,Royal Challengers Bangalore,15,0,KM Jadhav,M Chinnaswamy Stadium,NaN,NaN,NaN
7,8,2017,Indore,10/04/17,Royal Challengers Bangalore,Kings XI Punjab,Royal Challengers Bangalore,bat,normal,0,Kings XI Punjab,0,8,AR Patel,Holkar Cricket Stadium,AK Chaudhary,C Shamshuddin,NaN

In [268]:
field_df = grouped.get_group("field")
field_df.head(3)

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,05/04/17,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,2017,Pune,06/04/17,Mumbai Indians,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN
2,3,2017,Rajkot,07/04/17,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN

In [269]:
#level-wise summary statistic
grouped.win_by_runs.mean() #level-wise mean

toss_decision
bat      13.117216
field    14.107438
Name: win_by_runs, dtype: float64

In [270]:
grouped.count() #for the non-null values

,id,season,city,date,team1,team2,toss_winner,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
toss_decision,,,,,,,,,,,,,,,,,
bat,273,273,270,273,273,273,273,273,273,272,273,273,272,273,272,272,0
field,363,363,359,363,363,363,363,363,363,361,363,363,361,363,363,363,0

In [271]:
grouped.mean()

,id,season,dl_applied,win_by_runs,win_by_wickets,umpire3
toss_decision,,,,,,
bat,306.769231,2011.798535,0.021978,13.117216,3.36630,NaN
field,327.322314,2013.011019,0.027548,14.107438,3.37741,NaN

In [272]:
grouped[['season', 'win_by_runs']].mean()

                    season  win_by_runs
toss_decision
bat            2011.798535    13.117216
field          2013.011019    14.107438

In [273]:
grouped.describe()

                  id                                                           \
               count        mean         std  min    25%    50%    75%    max
toss_decision
bat            273.0  306.769231  163.443690  5.0  166.0  315.0  432.0  636.0
field          363.0  327.322314  197.401974  1.0  152.5  321.0  509.5  635.0

              season               ... win_by_wickets       umpire3           \
               count         mean  ...            75%   max   count mean std
toss_decision                      ...
bat            273.0  2011.798535  ...            7.0  10.0     0.0  NaN NaN
field          363.0  2013.011019  ...            6.0  10.0     0.0  NaN NaN


              min 25% 50% 75% max
toss_decision
bat           NaN NaN NaN NaN NaN
field         NaN NaN NaN NaN NaN

[2 rows x 48 columns]

In [274]:
#to apply 2 fns on each of the col
grouped.agg(['sum', np.mean])

                   id              season              dl_applied            \
                  sum        mean     sum         mean        sum      mean
toss_decision
bat             83748  306.769231  549221  2011.798535          6  0.021978
field          118818  327.322314  730723  2013.011019         10  0.027548

              win_by_runs            win_by_wickets          umpire3
                      sum       mean            sum     mean     sum mean
toss_decision
bat                  3581  13.117216            919  3.36630     0.0  NaN
field                5121  14.107438           1226  3.37741     0.0  NaN

In [ ]:
#Aggregations can also be used to specify different aggregation fn on each column

In [278]:
def data_range(series):
    return series.max() - series.min()

In [279]:
aggregations = {
                'season':{'Season_Mean': np.mean},
                'win_by_runs': {'Max_winbyruns': np.max, 'Range_win_by_runs': data_range},
                'win_by_wickets': {'Min_winbywickets': np.min }}

In [280]:
grouped.agg(aggregations)

                    season   win_by_runs                     win_by_wickets
               Season_Mean Max_winbyruns Range_win_by_runs Min_winbywickets
toss_decision
bat            2011.798535           111               111                0
field          2013.011019           146               146                0

In [277]:
#grouping by 2 categorical column - factor+factor+continuous aggregation
matches.groupby(['toss_decision', 'result']).win_by_runs.sum().unstack()

result         no result  normal  tie
toss_decision
bat                    0    3581    0
field                  0    5121    0

---

### Concatenation

In [281]:
brics

                CAPITAL    AREA  POPULATION
COUNTRY
Brazil         Brasilia   8.516      200.40
Russia           Moscow  17.100      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98

In [282]:
brics.reset_index(inplace = True)

In [283]:
dict2 = {
"country":["Brazil", "Russia"],
"capital":["Brasilia", "Moscow",],
"area":[8.516, 17.10],
"population":[200.4, 143.5] }

In [284]:
dummy = pd.DataFrame(dict2)
dummy

  country   capital    area  population
0  Brazil  Brasilia   8.516       200.4
1  Russia    Moscow  17.100       143.5

In [285]:
brics

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [287]:
brics.append(dummy) #new columns created because the column names are not same

C:\Users\Vaibhav\Anaconda3\lib\site-packages\pandas\core\frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

,AREA,CAPITAL,COUNTRY,POPULATION,area,capital,country,population
0,8.516,Brasilia,Brazil,200.40,NaN,NaN,NaN,NaN
1,17.100,Moscow,Russia,143.50,NaN,NaN,NaN,NaN
2,3.286,New Delhi,India,1252.00,NaN,NaN,NaN,NaN
3,9.597,Beijing,China,1357.00,NaN,NaN,NaN,NaN
4,1.221,Pretoria,South Africa,52.98,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,8.516,Brasilia,Brazil,200.4
1,NaN,NaN,NaN,NaN,17.100,Moscow,Russia,143.5

In [286]:
brics

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [288]:
dummy = dummy.rename(mapper = str.upper, axis = 1)

In [289]:
brics = brics.append(dummy)
brics

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50

In [290]:
brics.reset_index(inplace = True)

In [291]:
brics

   index       COUNTRY    CAPITAL    AREA  POPULATION
0      0        Brazil   Brasilia   8.516      200.40
1      1        Russia     Moscow  17.100      143.50
2      2         India  New Delhi   3.286     1252.00
3      3         China    Beijing   9.597     1357.00
4      4  South Africa   Pretoria   1.221       52.98
5      0        Brazil   Brasilia   8.516      200.40
6      1        Russia     Moscow  17.100      143.50

In [292]:
brics.drop("index", axis = 1, inplace=True)

In [295]:
#column-wise concatenation
x = pd.concat([brics, dummy], axis = 1)
x

,COUNTRY,CAPITAL,AREA,POPULATION,COUNTRY,CAPITAL,AREA,POPULATION
0,Brazil,Brasilia,8.516,200.40,Brazil,Brasilia,8.516,200.4
1,Russia,Moscow,17.100,143.50,Russia,Moscow,17.100,143.5
2,India,New Delhi,3.286,1252.00,NaN,NaN,NaN,NaN
3,China,Beijing,9.597,1357.00,NaN,NaN,NaN,NaN
4,South Africa,Pretoria,1.221,52.98,NaN,NaN,NaN,NaN
5,Brazil,Brasilia,8.516,200.40,NaN,NaN,NaN,NaN
6,Russia,Moscow,17.100,143.50,NaN,NaN,NaN,NaN

In [296]:
#to insert a column at pos3
brics.insert(loc = 3, column = "x", value = [1,2,3,4,5,6,7])

In [297]:
brics

        COUNTRY    CAPITAL    AREA  x  POPULATION
0        Brazil   Brasilia   8.516  1      200.40
1        Russia     Moscow  17.100  2      143.50
2         India  New Delhi   3.286  3     1252.00
3         China    Beijing   9.597  4     1357.00
4  South Africa   Pretoria   1.221  5       52.98
5        Brazil   Brasilia   8.516  6      200.40
6        Russia     Moscow  17.100  7      143.50

----

In [298]:
left = { 'id':[1,2,3,4,5],
         'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5']}

right = {'id':[1,6,3,4,5],
         'Height': [120,110,115,119,130],
         'subject_id':['sub2','sub4','sub3','sub6','sub5']}

In [299]:
left = pd.DataFrame(left)
left

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5

In [300]:
right = pd.DataFrame(right)
right

   id  Height subject_id
0   1     120       sub2
1   6     110       sub4
2   3     115       sub3
3   4     119       sub6
4   5     130       sub5

In [301]:
a = pd.merge(left, right, how = "inner", on ="id")
a

   id    Name subject_id_x  Height subject_id_y
0   1    Alex         sub1     120         sub2
1   3   Allen         sub4     115         sub3
2   4   Alice         sub6     119         sub6
3   5  Ayoung         sub5     130         sub5

In [ ]:
import pandasql as pdsql

In [ ]:
hyp.head(3)

In [ ]:
str1= "select Read, Math1 from hyp where Read<30 or Math1 >60 ;"

In [ ]:
df1 = pdsql.sqldf(str1)

In [ ]:
df1.head(3)

---

In [ ]:
### How to use the string functions on a character columns

In [ ]:
matches.head(3)

In [ ]:
matches.player_of_match.iloc[0].split()

In [ ]:
matches.player_of_match.str.split()[:3] #then this string fn will be automatically applied to each row in this series

In [ ]:
matches.fname = matches.player_of_match.str.split().str[0]

In [ ]:
matches.fname[:3]

In [ ]:
matches.fname = matches.player_of_match.str.split().str.get(0)

In [ ]:
matches.fname[:4]

In [ ]:
#Suppose you want to convert the toss decision to upper case
matches.toss_decision = matches.toss_decision.str.upper()

In [ ]:
#how do i loop over the rows of the dataframe
len(brics) #corresponding to 7 rows

In [ ]:
#to iterate over each row of the df
for row in range(len(brics)):
    print(brics.iloc[row],"\n")

In [ ]:
for lab, row in brics.iterrows():
    print(lab)
    print()
    print(row['AREA'])
    print()
    print()

In [ ]:
#can be used to iterate over the columns
i in brics:
    print(i)

In [ ]:
matches['toss_d'] = 'a'

In [ ]:
matches.head(3)

In [ ]:
matches.toss_decision[0]= matches.toss_decision[0].upper()

In [ ]:
matches.toss_decision[0]

In [ ]:
matches.toss_decision.dtype

In [ ]:
matches["toss_d"].dtype

In [ ]:
matches['toss_d'][0] = matches.toss_decision[0].upper()

In [ ]:
for i in range(len(matches[:5])):
    matches['toss_d'][i] = matches.toss_decision[i].upper()

In [ ]:
matches["toss_d"][:4]

In [ ]:
matches["match_opponents"] = matches['team1'] + " vs "+ matches['team2']

In [ ]:
### Apply function - to apply some function on each component of the series

In [ ]:
brics.COUNTRY[:4]

In [ ]:
brics["length_country"] = brics.COUNTRY.apply(len)

In [ ]:
brics

In [ ]:
s = pd.Series([20,21,12], index = ['London', "New York", "California"])

In [ ]:
s

In [ ]:
s.apply(np.log)

In [ ]:
def add_custom_values(x, *args, **kwargs):
    for month in kwargs:
        x+=kwargs[month]
    return x

a = s.apply(add_custom_values, june = 30, july = 31, aug = 25, sept = 100)
pd.DataFrame(data = [s,a])

In [ ]:
brics

In [135]:
brics.COUNTRY.map(len)

AttributeError: 'DataFrame' object has no attribute 'COUNTRY'

In [ ]:
brics.COUNTRY.map(lambda x: len(x))

In [ ]:
brics.COUNTRY.map({'Brazil': 'Br', "India": "Ind"})

In [ ]:
hyp.Gender.map({0: "M", 1: "F"})[:3] 
#so map can map a fn or a dictionary on each component of the series

In [ ]:
brics.COUNTRY.replace("Brazil", "Br") 
#so Brazil gets replaced by Br and other values are not replaced

In [ ]:
brics.COUNTRY.replace(to_replace = "^B", value = "New", regex= True)

In [ ]:
hyp.Gender.replace({0: "Male", 1:"Female"})[:5]

In [ ]:
#to remove the duplicate rows
matches  = matches.drop_duplicates()

In [ ]:
set('america') #unordered

----

In [ ]:
#to delete rows axis = 0 and to delete cols axis = 1

In [ ]:
matches.drop([0,1], axis=0 )[:2] #as a result, row labels 0 and 1 are dropped

In [ ]:
matches.sort_values(by = ['team1',"win_by_runs"], ascending=True)

In [ ]:
matches.to_csv("file.csv")

---

In [ ]:
#Regular expressions to clean the strings

In [ ]:
data = {'raw': ['Arizona 1 2014-12-23       3242.0',
                'Iowa 1 2010-02-23       3453.7',
                'Oregon 0 2014-06-20       2123.0',
                'Maryland 0 2014-03-14       1123.6',
                'Florida 1 2013-01-15       2134.0',
                'Georgia 0 2012-07-14       2345.6']}
df = pd.DataFrame(data, columns = ['raw'])
df

In [ ]:
a = df.iloc[0][0]
a

In [ ]:
import re
re.search("(\d)", a)

In [ ]:
#to extract single digit in the strings
df['female'] = df['raw'].str.extract("(\d)", expand=True)
df

In [ ]:
df['date'] = df['raw'].str.extract('(....-..-..)', expand= True)

In [ ]:
df

In [ ]:
df['score'] = df['raw'].str.extract('(\d\d\d\d\.\d)', expand = True)

In [ ]:
df

In [ ]:
df['state'] = df['raw'].str.extract('([A-Z]\w{1,})', expand = True)
df